---
kind: property
id: P:Autodesk.Revit.DB.TemporaryViewModes.RevealConstraints
source: html/ed674ada-1358-434b-2965-fccd01a3401c.htm
---
# Autodesk.Revit.DB.TemporaryViewModes.RevealConstraints Property

The current state of the RevealConstraints mode in the associated view.

## Syntax (C#)
```csharp
public bool RevealConstraints { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - When setting this property: The RevealConstraints mode is either disabled or inapplicable in the associated view.